[
    {
        "id": 1,
        "name": {
            "en": "Kasa Web App",
            "fr": "Kasa Web App"
        },
        "description": {
            "en": "Redesign of a web app using React and Figma.",
            "fr": "Refonte d'une application web avec React et Figma."
        },
        "detailedDescription": {
            "en": "For this project I had to follow a dynamic mock-up made with Figma and recreate the frontend of the application in React with create-react-app. I had to use different hooks and react-router to manage the architecture of the application in an optimal way. The app is also responsive. I am currently refactoring the project to integrate a backend and a database as well as a login system to be able to fetch and store new content.",
            "fr": "Pour ce projet j'ai du suivre un mock-up dynamique réalisé avec Figma et recréer le frontend de l'application en React avec create-react-app. J'ai du utiliser différents hooks et react-router pour gérer l'architecture de l'application de façon optimale. L'application est également responsive. Je suis actuellement en train de refactoriser le projet pour intégrer un backend et une base de données ainsi qu'un système de connexion pour pouvoir récupérer et stocker de nouveaux contenus."
        },
        "issues": {
            "en": "Broadly speaking, learning React was done progressively and the courses were well designed. I had some difficulty understanding how hooks work and how to navigate the project's architecture but I was able to solve those issues by researching and practicing.",
            "fr": "De manière générale, l'apprentissage de React s'est fait de manière progressive et les cours étaient bien conçus. J'ai eu quelques difficultés à comprendre le fonctionnement des hooks et comment naviguer l'architecture du projet mais j'ai pu les résoudre en me documentant et en pratiquant."
        },
        "cover": {
            "url": "/assets/images/projects/Kasa/Kasa-cover.webp",
            "alt": {
                "en": "Homepage of the Kasa real estate rental application ",
                "fr": "page d'accueil de l'application de location immobilière Kasa"
            }
        },
        "images": {
            "1": {
                "url": "/assets/images/projects/Kasa/Kasa-cover.webp",
                "alt": {
                    "en": "Homepage of the Kasa real estate rental application ",
                    "fr": "page d'accueil de l'application de location immobilière Kasa"
                }
            },
            "2": {
                "url": "/assets/images/projects/Kasa/Kasa-logements.webp",
                "alt": {
                    "en": "A rental property page displaying all the information related to it.",
                    "fr": "page d'un logement en location affichant toutes les informations relatives à celui-ci."
                }
            },
            "3": {
                "url": "/assets/images/projects/Kasa/Kasa-about.webp",
                "alt": {
                    "en": "An About page containing various pieces of information in collapsible panels. ",
                    "fr": "page à propos contenant diverses informations dans des panneaux déroulants."
                }
            },
            "4": {
                "url": "/assets/images/projects/Kasa/Kasa-mobile.webp",
                "alt": {
                    "en": "Mobile version of Kasa's homepage, a real estate rental application ",
                    "fr": "Version mobile de la page d'accueil de l'application de location immobilière Kasa"
                }
            }
        },
        "tags": ["React", "Sass", "Figma", "Responsive", "React-router"],
        "website": "https://rossignolbrigand.github.io/Kasa-App-React/",
        "codebase": "https://github.com/RossignolBrigand/Kasa-App-React"
    },
    {
        "id": 2,
        "name": {
            "en": "REST API and Database creation",
            "fr": "Création d'API REST et base de données"
        },
        "description": {
            "en": "Creation and management of a secure backend system with a REST API and a MongoDB database.",
            "fr": "Création et gestion d'un système backend sécurisé avec une API REST et une base de données MongoDB."
        },
        "detailedDescription": {
            "en": "For this project I had to build a Nodejs / Express server and link it to a MongoDb database. After that I also had to create an authentication system and a CRUD system to manage the data stored in the database. I also had to ensure the seurity of the data stored witihn the database using hashing methods which with today's security standards. This project was very formative and I learned a lot about the backend and data management and security. I intend to refactor this project to integrate it into a frontend and create a fullstack application with new possibilities for users such as sharing a book or comment them.",
            "fr": "Pour ce projet j'ai du construire un serveur Nodejs/Express et le relier à une base de données MongoDb. Après cela j'ai du également créer un système d'authentification et un système CRUD pour gérer les données stockées dans la base de données. J'ai également du m'assurer de la sécurité des données stockées au sein de la base de données en utilisant des méthodes de hashage conformes aux standards de sécurité actuels. Ce projet a été très formateur et j'ai beaucoup appris sur le backend et la gestion des données et de la sécurité. Je compte refactoriser ce projet pour l'intégrer à un frontend et créer une application fullstack avec de nouvelles possibilités pour les utilisateurs telles que le partage d'un livre ou les commenter."
        },
        "issues": {
            "en": "This project like the React project had great courses and I learned quickly how to handle the routes. I had some difficulties with the security part of the project, particularly understanding how to make sure my routes were secure when feching data but I was able to solve them through research and testing.",
            "fr": "Ce projet comme le projet React avait de très bons cours et j'ai appris rapidement à gérer les routes. J'ai eu quelques difficultés avec la partie sécurité du projet, notamment à comprendre comment m'assurer que mes routes étaient sécurisées lors de la récupération de données mais j'ai pu les résoudre grâce à la recherche et aux tests."
        },
        "cover": {
            "url": "/assets/images/projects/Grimoire/Grimoire-cover.webp",
            "alt": {
                "en": "homepage of the website Mon Vieux Grimoire.",
                "fr": "page d'accueil du site Mon Vieux Grimoire."
            }
        },
        "images": {
            "1": {
                "url": "/assets/images/projects/Grimoire/Grimoire-cover.webp",
                "alt": {
                    "en": "homepage of the website Mon Vieux Grimoire.",
                    "fr": "page d'accueil du site Mon Vieux Grimoire."
                }
            },
            "2": {
                "url": "/assets/images/projects/Grimoire/Grimoire-book.webp",
                "alt": {
                    "en": "File upload form from the Mon Vieux Grimoire website.",
                    "fr": "Formulaire d'ajout de fichier du site Mon Vieux Grimoire."
                }
            },
            "3": {
                "url": "/assets/images/projects/Grimoire/Grimoire-login.webp",
                "alt": {
                    "en": "Login page of the Mon Vieux Grimoire website.",
                    "fr": "Page de connexion du site Mon Vieux Grimoire."
                }
            },
            "4": {
                "url": "/assets/images/projects/Grimoire/Grimoire-routes.webp",
                "alt": {
                    "en": "Screenshot of some of the CRUD routes of the server.",
                    "fr": "Capture d'écran de certaines des routes CRUD du serveur."
                }
            },
            "5": {
                "url": "/assets/images/projects/Grimoire/Grimoire-auth.webp",
                "alt": {
                    "en": "Screenshot of the authentication routes within the server featuring bcrypt and jsonwebtoken.",
                    "fr": "Capture d'écran des routes d'authentification au sein du serveur avec bcrypt et jsonwebtoken."
                }
            }
        },
        "tags": ["Node.js", "Express", "MongoDB", "REST", "CRUD", "Security"],
        "website": "https://rossignolbrigand.github.io/Openclassrooms_Projet_06/",
        "codebase": "https://github.com/RossignolBrigand/Openclassrooms_Projet_06"
    },
    {
        "id": 3,
        "name": {
            "en": "Photograph's portfolio",
            "fr": "Portfolio d'une photographe"
        },
        "description": {
            "en": "The portfolio website of an architect. The website is mostly generated dynamically with Javascript and has a secure connexion to a Node server.",
            "fr": "Le site portfolio d'une architecte. Le site est généré de façon dynamique avec Javascript et possède une connexion sécurisée à un serveur N ode."
        },
        "detailedDescription": {
            "en": "This project is built dynamically with JavaScript and has a token-secured connection system and a backend that allows data to be retrieved and stored. My mission was multiple: Retrieve the data stored in the database and filter the works according to their categories, manage the secure connection system via authentication token recovery and create a modal to view and modify the files present in the database live. All in pure Javascript. This project was very formative and it is currently being redesigned.",
            "fr": "Ce projet est construit de façon dynamique avec JavaScript et possède un système de connexion sécurisé par token et un backend qui permet de récupérer et stocker des données. Ma mission était multiple : Récupérer les données stockées dans la base de données et filtrer les travaux selon leurs catégories, gérer le système de connexion sécurisé via récupération de token d'authentification et créer une modale permettant de visualiser et de modifier en direct les fichiers présents dans la base de données. Le tout en pur Javascript. Ce projet a été très formatteur et il est actuellement en refonte."
        },
        "issues": {
            "en": "I have to admit the biggest issue I had was to understand why working locally could affect cors issues and how to circumvent them. Another issue was to understand the asynchronous nature of Javascript and how to manage the data fetched from the server. It was the beginning of my web dev journey and I took the time to make sure I understood the concepts before moving on.",
            "fr": "Je dois avouer que le plus gros problème que j'ai eu était de comprendre pourquoi travailler en local pouvait affecter les problèmes de cors et comment les contourner. Un autre problème était de comprendre la nature asynchrone de Javascript et comment gérer les données récupérées du serveur. C'était le début de mon parcours de développeur web et j'ai pris le temps de m'assurer que je comprenais les concepts avant de passer à autre chose."
        },
        "cover": {
            "url": "/assets/images/projects/Bluel/Bluel-cover.webp",
            "alt": {
                "en": "Homepage of an architect's portfolio.",
                "fr": "Page d'accueil du portfolio d'une architecte."
            }
        },
        "images": {
            "1": {
                "url": "/assets/images/projects/Bluel/Bluel-login.webp",
                "alt": {
                    "en": "Login page of the architect's portfolio.",
                    "fr": "Page de connexion du portfolio de l'architecte"
                }
            },
            "2": {
                "url": "/assets/images/projects/Bluel/Bluel-admin.webp",
                "alt": {
                    "en": "Homepage in admin mode with new buttons labeled modify here and there.",
                    "fr": "Page d'accueil en mode administrateur avec l'apparition de boutons labelisés modifier."
                }
            },
            "3": {
                "url": "/assets/images/projects/Bluel/Bluel-modal.webp",
                "alt": {
                    "en": "The admin modal showing all the pictures in the database and a button to delete them. There is also a button to upload a new picture.",
                    "fr": "La modale administrateur qui affiche toutes les images présentes dans la base de données avec un bouton pour les supprimer. Il y'a aussi un bouton pour téléverser un nouveau fichier."
                }
            },
            "4": {
                "url": "/assets/images/projects/Bluel/Bluel-modal2.webp",
                "alt": {
                    "en": "The admin modal showing the form to uplaod new files to the database.",
                    "fr": "La modale administrateur qui affiche le formulaire pour téléverser un ouveau fichier."
                }
            }
        },
        "tags": ["HTML", "CSS", "JS"],
        "website": "https://rossignolbrigand.github.io/OpenClassrooms_Projet_03/FrontEnd/index.html",
        "codebase": "https://github.com/RossignolBrigand/OpenClassrooms_Projet_03"
    },
    {
        "id": 4,
        "name": {
            "en": "Optimisation of a client's portfolio",
            "fr": "Optimisation du portfolio d'une cliente"
        },
        "description": {
            "en": "Debugging and optimization of a photographer's portfolio, which was bugged and contained no metadata and had accessibility issues.",
            "fr": "Débogage et optimisation du portfolio d'une photographe, qui avait des bugs, ne contenait aucunes metadonnées et avait des problèmes d'accessibilité."
        },
        "detailedDescription": {
            "en": "The objective of this project was to identify bugs in the CSS created by the client and then optimize the site's performance, accessibility, and local SEO. At the time, I wasn't familiar with Bootstrap, and it was interesting to work through code that I hadn't written myself. I had to create several metadata elements to optimize local SEO and address a number of accessibility issues, particularly related to buttons and empty alt attributes on images.",
            "fr": "L'objectif de ce projet était trouver des bugs dans le CSS créé par la cliente puis d'optimiser les performances du site, son accessibilité ainsi que son réferencement local. À l'époque je ne connaissais pas bootstrap et il était intéressant de parcourir du code que l'on a pas conçu soi-même. J'ai du créer un certain nombre de métadonnées pour optimiser le réferencement local et gérer un certain nombre de problèmes d'accessibilité notamment dus à des boutons et des balises alt vides sur les images."
        },
        "issues": {
            "en": "At first I had no issues understanding how to optimize the project, but I admit I was scared having to deal with a project that wasn't mine. I could not take the time to understand the code and the structure of the project or learn Bootstrap, but I got the logic quickly (it wasn't hard to be honest although Bootstrap was daunting). In the end the main problem was balance the optimization results and the time it took to setup.",
            "fr": "Au début je n'ai pas eu de problèmes à comprendre comment optimiser le projet mais j'avoue que j'avais peur de devoir gérer un projet qui n'était pas le mien. Je n'ai pas pu prendre le temps de comprendre le code et la structure du projet ou d'apprendre Bootstrap mais j'ai compris la logique rapidement (ce n'était pas difficile pour être honnête même si Bootstrap était intimidant). Au final le problème principal était d'équilibrer les résultats de l'optimisation et le temps que cela prenait à mettre en place."
        },
        "cover": {
            "url": "/assets/images/projects/Carducci/PhotographPortfolioCover-small.webp",
            "alt": {
                "en": "landing page of a photographer's portfolio with some portraits.",
                "fr": "page d'accueil du portfolio d'une photographe avec plusieurs portraits."
            }
        },
        "images": {
            "1": {
                "url": "/assets/images/projects/Carducci/PhotographPortfolio1.webp",
                "alt": {
                    "en": "image gallery of the portfolio",
                    "fr": "gallerie d'images du portfolio"
                }
            },
            "2": {
                "url": "/assets/images/projects/Carducci/PhotographPortfolio2.webp",
                "alt": {
                    "en": "lighthouse report showing the website's performances on load",
                    "fr": "rapport de performances lighhouse montrant les performances du site au chargement"
                }
            },
            "3": {
                "url": "/assets/images/projects/Carducci/PhotographPortfolio3.webp",
                "alt": {
                    "en": "Wave accessibility report showing the website's optimisation",
                    "fr": "Rapport d'accessibilité wave montrant l'optimisation du site"
                }
            },
            "4": {
                "url": "/assets/images/projects/Carducci/PhotographPortfolio4.webp",
                "alt": {
                    "en": "Section of the website and a preview of the openGraph card demonstrating the metadata embedded in the website",
                    "fr": "Section du site et une prévisualisation du système de partage openGraph utilisant les métadonnées insérées dans le site"
                }
            },
            "5": {
                "url": "/assets/images/projects/Carducci/PhotographPortfolio5.webp",
                "alt": {
                    "en": "Google business report showing the enriched data present in the website and shared to robots",
                    "fr": "Rapport de données Google Business montrant les données enrichies récupérées par les robots."
                }
            }
        },
        "tags": [
            "SEO",
            "Accessibility",
            "Optimization",
            "Debugging",
            "Metadata"
        ],
        "website": "https://rossignolbrigand.github.io/Openclassrooms_Projet_04/",
        "codebase": "https://github.com/RossignolBrigand/Openclassrooms_Projet_04"
    }
]
